Revit 2026 API

# BoundingBoxXYZ Properties

---

The BoundingBoxXYZ type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BoundEnabled | Indexed access for loops. |
|  | Bounds | Indexed access for loops. Use 0 for Min and 1 for Max. |
|  | Enabled | Defines whether the entire bounding box is enabled. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsSet | Indicates whether the bounding box is set. |
|  | Max | Maximum coordinates (upper-right-front corner of the box). |
|  | MaxEnabled | Defines whether the maximum bound is active for given dimension. |
|  | Min | Minimum coordinates (lower-left-rear corner of the box). |
|  | MinEnabled | Defines whether the minimum bound is active for given dimension. |
|  | Transform | The transform from the coordinate space of the box to the model coordinate space. |

#### Reference

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace